tap "homebrew/bundle"
tap "aquaproj/aqua"
brew "aquaproj/aqua/aqua"
brew "diff-so-fancy"
brew "ijq"
brew "libyaml" # for ruby-build
brew "nodenv"
brew "pipx" # to intell poetry
brew "pyenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "tree"
brew "watch"
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "google-chrome"
cask "raycast"
cask "keyboard-cleaner"
cask "karabiner-elements"
cask "zoom"
cask "dash"
cask "docker"
cask "1password"
cask "kitty"
cask "notion"
cask "notion-calendar"
cask "swiftformat-for-xcode"
cask "google-cloud-sdk"
cask "font-jetbrains-mono-nerd-font"
mas "Magnet", id: 441258766
mas "PopClip", id: 445189367
mas "Slack", id: 803453959
mas "OmniFocus", id: 1542143627 # OmniFocus 4
mas "Keynote", id: 409183694
mas "Toggl", id: 1291898086
