tap "homebrew/bundle"
brew "awscli"
brew "bat"
brew "coreutils"
brew "csvlens"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghcup"
brew "ghq"
brew "go"
brew "jq"
brew "ijq"
brew "libyaml" # for ruby-build
brew "neovim"
brew "nodenv"
brew "pipx" # to intell poetry
brew "pixman" # for canvas
brew "postgresql" # for Rails dev
brew "pyenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis" # for codecrafters
brew "ripgrep"
brew "sqlfluff"
brew "terraform"
brew "tokei"
brew "tree"
brew "watch"
brew "watchman" # jest:watch
brew "yq"
brew "aquaproj/aqua/aqua"
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "google-chrome"
cask "raycast"
cask "keyboard-cleaner"
cask "karabiner-elements"
cask "zoom"
cask "dash"
cask "docker"
cask "1password"
cask "kitty"
cask "notion"
cask "notion-calendar"
cask "swiftformat-for-xcode"
cask "google-cloud-sdk"
mas "Magnet", id: 441258766
mas "PopClip", id: 445189367
mas "Slack", id: 803453959
mas "OmniFocus", id: 1542143627 # OmniFocus 4
mas "Keynote", id: 409183694
mas "Toggl", id: 1291898086

# for canvas
brew "cairo"
brew "pkg-config"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"

# for https://operating-system-in-1000-lines.vercel.app/ja/setting-up-development-environment
brew "llvm"
brew "qemu"
