tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bat"
brew "coreutils"
brew "diff-so-fancy"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghq"
brew "go"
brew "jq"
brew "neovim"
brew "nodenv"
brew "postgresql" # for Rails dev
brew "pyenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "stack"
brew "the_silver_searcher"
brew "tokei"
brew "tree"
cask "karabiner-elements"
cask "visual-studio-code"
cask "google-japanese-ime"
cask "google-chrome"
cask "raycast"
cask "keyboard-cleaner"
cask "karabiner-elements"
cask "zoom"
cask "dash"
cask "docker"
cask "1password"
cask "kitty"
cask "notion"
mas "Magnet", id: 441258766
mas "PopClip", id: 445189367
mas "Slack", id: 803453959
mas "OmniFocus", id: 1346203938
mas "Keynote", id: 409183694
