tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "bat"
brew "diff-so-fancy"
brew "direnv"
brew "gh"
brew "ghq"
brew "go"
brew "jq"
brew "neovim"
brew "nodenv"
brew "peco"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
cask "coqide"
cask "visual-studio-code"
